ataradov/mcu-starter-projects/samg53/include/component/twi.h
/**
 * \file
 *
 * \brief Component description for TWI
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-07-05T18:00:00Z */
#ifndef _SAMG53_TWI_COMPONENT_H_
#define _SAMG53_TWI_COMPONENT_H_
#define _SAMG53_TWI_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMG_SAMG53 Two-wire Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TWI */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define TWI_6212                       /**< (TWI) Module ID */
#define REV_TWI Z                      /**< (TWI) Module revision */

/* -------- TWI_CR : (TWI Offset: 0x00) (/W 32) Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t START:1;                   /**< bit:      0  Send a START Condition                   */
    uint32_t STOP:1;                    /**< bit:      1  Send a STOP Condition                    */
    uint32_t MSEN:1;                    /**< bit:      2  TWI Master Mode Enabled                  */
    uint32_t MSDIS:1;                   /**< bit:      3  TWI Master Mode Disabled                 */
    uint32_t SVEN:1;                    /**< bit:      4  TWI Slave Mode Enabled                   */
    uint32_t SVDIS:1;                   /**< bit:      5  TWI Slave Mode Disabled                  */
    uint32_t QUICK:1;                   /**< bit:      6  SMBus Quick Command                      */
    uint32_t SWRST:1;                   /**< bit:      7  Software Reset                           */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_CR_OFFSET                       (0x00)                                        /**<  (TWI_CR) Control Register  Offset */

#define TWI_CR_START_Pos                    0                                              /**< (TWI_CR) Send a START Condition Position */
#define TWI_CR_START_Msk                    (_U_(0x1) << TWI_CR_START_Pos)                 /**< (TWI_CR) Send a START Condition Mask */
#define TWI_CR_START                        TWI_CR_START_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_START_Msk instead */
#define TWI_CR_STOP_Pos                     1                                              /**< (TWI_CR) Send a STOP Condition Position */
#define TWI_CR_STOP_Msk                     (_U_(0x1) << TWI_CR_STOP_Pos)                  /**< (TWI_CR) Send a STOP Condition Mask */
#define TWI_CR_STOP                         TWI_CR_STOP_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_STOP_Msk instead */
#define TWI_CR_MSEN_Pos                     2                                              /**< (TWI_CR) TWI Master Mode Enabled Position */
#define TWI_CR_MSEN_Msk                     (_U_(0x1) << TWI_CR_MSEN_Pos)                  /**< (TWI_CR) TWI Master Mode Enabled Mask */
#define TWI_CR_MSEN                         TWI_CR_MSEN_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_MSEN_Msk instead */
#define TWI_CR_MSDIS_Pos                    3                                              /**< (TWI_CR) TWI Master Mode Disabled Position */
#define TWI_CR_MSDIS_Msk                    (_U_(0x1) << TWI_CR_MSDIS_Pos)                 /**< (TWI_CR) TWI Master Mode Disabled Mask */
#define TWI_CR_MSDIS                        TWI_CR_MSDIS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_MSDIS_Msk instead */
#define TWI_CR_SVEN_Pos                     4                                              /**< (TWI_CR) TWI Slave Mode Enabled Position */
#define TWI_CR_SVEN_Msk                     (_U_(0x1) << TWI_CR_SVEN_Pos)                  /**< (TWI_CR) TWI Slave Mode Enabled Mask */
#define TWI_CR_SVEN                         TWI_CR_SVEN_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_SVEN_Msk instead */
#define TWI_CR_SVDIS_Pos                    5                                              /**< (TWI_CR) TWI Slave Mode Disabled Position */
#define TWI_CR_SVDIS_Msk                    (_U_(0x1) << TWI_CR_SVDIS_Pos)                 /**< (TWI_CR) TWI Slave Mode Disabled Mask */
#define TWI_CR_SVDIS                        TWI_CR_SVDIS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_SVDIS_Msk instead */
#define TWI_CR_QUICK_Pos                    6                                              /**< (TWI_CR) SMBus Quick Command Position */
#define TWI_CR_QUICK_Msk                    (_U_(0x1) << TWI_CR_QUICK_Pos)                 /**< (TWI_CR) SMBus Quick Command Mask */
#define TWI_CR_QUICK                        TWI_CR_QUICK_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_QUICK_Msk instead */
#define TWI_CR_SWRST_Pos                    7                                              /**< (TWI_CR) Software Reset Position */
#define TWI_CR_SWRST_Msk                    (_U_(0x1) << TWI_CR_SWRST_Pos)                 /**< (TWI_CR) Software Reset Mask */
#define TWI_CR_SWRST                        TWI_CR_SWRST_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_CR_SWRST_Msk instead */
#define TWI_CR_MASK                         _U_(0xFF)                                      /**< \deprecated (TWI_CR) Register MASK  (Use TWI_CR_Msk instead)  */
#define TWI_CR_Msk                          _U_(0xFF)                                      /**< (TWI_CR) Register Mask  */


/* -------- TWI_MMR : (TWI Offset: 0x04) (R/W 32) Master Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t IADRSZ:2;                  /**< bit:   8..9  Internal Device Address Size             */
    uint32_t :2;                        /**< bit: 10..11  Reserved */
    uint32_t MREAD:1;                   /**< bit:     12  Master Read Direction                    */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t DADR:7;                    /**< bit: 16..22  Device Address                           */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_MMR_Type;
