ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_MMR_OFFSET                      (0x04)                                        /**<  (TWI_MMR) Master Mode Register  Offset */

#define TWI_MMR_IADRSZ_Pos                  8                                              /**< (TWI_MMR) Internal Device Address Size Position */
#define TWI_MMR_IADRSZ_Msk                  (_U_(0x3) << TWI_MMR_IADRSZ_Pos)               /**< (TWI_MMR) Internal Device Address Size Mask */
#define TWI_MMR_IADRSZ(value)               (TWI_MMR_IADRSZ_Msk & ((value) << TWI_MMR_IADRSZ_Pos))
#define   TWI_MMR_IADRSZ_NONE_Val           _U_(0x0)                                       /**< (TWI_MMR) No internal device address  */
#define   TWI_MMR_IADRSZ_1_BYTE_Val         _U_(0x1)                                       /**< (TWI_MMR) One-byte internal device address  */
#define   TWI_MMR_IADRSZ_2_BYTE_Val         _U_(0x2)                                       /**< (TWI_MMR) Two-byte internal device address  */
#define   TWI_MMR_IADRSZ_3_BYTE_Val         _U_(0x3)                                       /**< (TWI_MMR) Three-byte internal device address  */
#define TWI_MMR_IADRSZ_NONE                 (TWI_MMR_IADRSZ_NONE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) No internal device address Position  */
#define TWI_MMR_IADRSZ_1_BYTE               (TWI_MMR_IADRSZ_1_BYTE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) One-byte internal device address Position  */
#define TWI_MMR_IADRSZ_2_BYTE               (TWI_MMR_IADRSZ_2_BYTE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) Two-byte internal device address Position  */
#define TWI_MMR_IADRSZ_3_BYTE               (TWI_MMR_IADRSZ_3_BYTE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) Three-byte internal device address Position  */
#define TWI_MMR_MREAD_Pos                   12                                             /**< (TWI_MMR) Master Read Direction Position */
#define TWI_MMR_MREAD_Msk                   (_U_(0x1) << TWI_MMR_MREAD_Pos)                /**< (TWI_MMR) Master Read Direction Mask */
#define TWI_MMR_MREAD                       TWI_MMR_MREAD_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_MMR_MREAD_Msk instead */
#define TWI_MMR_DADR_Pos                    16                                             /**< (TWI_MMR) Device Address Position */
#define TWI_MMR_DADR_Msk                    (_U_(0x7F) << TWI_MMR_DADR_Pos)                /**< (TWI_MMR) Device Address Mask */
#define TWI_MMR_DADR(value)                 (TWI_MMR_DADR_Msk & ((value) << TWI_MMR_DADR_Pos))
#define TWI_MMR_MASK                        _U_(0x7F1300)                                  /**< \deprecated (TWI_MMR) Register MASK  (Use TWI_MMR_Msk instead)  */
#define TWI_MMR_Msk                         _U_(0x7F1300)                                  /**< (TWI_MMR) Register Mask  */


/* -------- TWI_SMR : (TWI Offset: 0x08) (R/W 32) Slave Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :16;                       /**< bit:  0..15  Reserved */
    uint32_t SADR:7;                    /**< bit: 16..22  Slave Address                            */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_SMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_SMR_OFFSET                      (0x08)                                        /**<  (TWI_SMR) Slave Mode Register  Offset */

#define TWI_SMR_SADR_Pos                    16                                             /**< (TWI_SMR) Slave Address Position */
#define TWI_SMR_SADR_Msk                    (_U_(0x7F) << TWI_SMR_SADR_Pos)                /**< (TWI_SMR) Slave Address Mask */
#define TWI_SMR_SADR(value)                 (TWI_SMR_SADR_Msk & ((value) << TWI_SMR_SADR_Pos))
#define TWI_SMR_MASK                        _U_(0x7F0000)                                  /**< \deprecated (TWI_SMR) Register MASK  (Use TWI_SMR_Msk instead)  */
#define TWI_SMR_Msk                         _U_(0x7F0000)                                  /**< (TWI_SMR) Register Mask  */


/* -------- TWI_IADR : (TWI Offset: 0x0c) (R/W 32) Internal Address Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t IADR:24;                   /**< bit:  0..23  Internal Address                         */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_IADR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_IADR_OFFSET                     (0x0C)                                        /**<  (TWI_IADR) Internal Address Register  Offset */

#define TWI_IADR_IADR_Pos                   0                                              /**< (TWI_IADR) Internal Address Position */
#define TWI_IADR_IADR_Msk                   (_U_(0xFFFFFF) << TWI_IADR_IADR_Pos)           /**< (TWI_IADR) Internal Address Mask */
#define TWI_IADR_IADR(value)                (TWI_IADR_IADR_Msk & ((value) << TWI_IADR_IADR_Pos))
#define TWI_IADR_MASK                       _U_(0xFFFFFF)                                  /**< \deprecated (TWI_IADR) Register MASK  (Use TWI_IADR_Msk instead)  */
#define TWI_IADR_Msk                        _U_(0xFFFFFF)                                  /**< (TWI_IADR) Register Mask  */


/* -------- TWI_CWGR : (TWI Offset: 0x10) (R/W 32) Clock Waveform Generator Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CLDIV:8;                   /**< bit:   0..7  Clock Low Divider                        */
    uint32_t CHDIV:8;                   /**< bit:  8..15  Clock High Divider                       */
    uint32_t CKDIV:3;                   /**< bit: 16..18  Clock Divider                            */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t HOLD:5;                    /**< bit: 24..28  TWD Hold Time versus TWCK falling        */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_CWGR_Type;
