ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_CWGR_OFFSET                     (0x10)                                        /**<  (TWI_CWGR) Clock Waveform Generator Register  Offset */

#define TWI_CWGR_CLDIV_Pos                  0                                              /**< (TWI_CWGR) Clock Low Divider Position */
#define TWI_CWGR_CLDIV_Msk                  (_U_(0xFF) << TWI_CWGR_CLDIV_Pos)              /**< (TWI_CWGR) Clock Low Divider Mask */
#define TWI_CWGR_CLDIV(value)               (TWI_CWGR_CLDIV_Msk & ((value) << TWI_CWGR_CLDIV_Pos))
#define TWI_CWGR_CHDIV_Pos                  8                                              /**< (TWI_CWGR) Clock High Divider Position */
#define TWI_CWGR_CHDIV_Msk                  (_U_(0xFF) << TWI_CWGR_CHDIV_Pos)              /**< (TWI_CWGR) Clock High Divider Mask */
#define TWI_CWGR_CHDIV(value)               (TWI_CWGR_CHDIV_Msk & ((value) << TWI_CWGR_CHDIV_Pos))
#define TWI_CWGR_CKDIV_Pos                  16                                             /**< (TWI_CWGR) Clock Divider Position */
#define TWI_CWGR_CKDIV_Msk                  (_U_(0x7) << TWI_CWGR_CKDIV_Pos)               /**< (TWI_CWGR) Clock Divider Mask */
#define TWI_CWGR_CKDIV(value)               (TWI_CWGR_CKDIV_Msk & ((value) << TWI_CWGR_CKDIV_Pos))
#define TWI_CWGR_HOLD_Pos                   24                                             /**< (TWI_CWGR) TWD Hold Time versus TWCK falling Position */
#define TWI_CWGR_HOLD_Msk                   (_U_(0x1F) << TWI_CWGR_HOLD_Pos)               /**< (TWI_CWGR) TWD Hold Time versus TWCK falling Mask */
#define TWI_CWGR_HOLD(value)                (TWI_CWGR_HOLD_Msk & ((value) << TWI_CWGR_HOLD_Pos))
#define TWI_CWGR_MASK                       _U_(0x1F07FFFF)                                /**< \deprecated (TWI_CWGR) Register MASK  (Use TWI_CWGR_Msk instead)  */
#define TWI_CWGR_Msk                        _U_(0x1F07FFFF)                                /**< (TWI_CWGR) Register Mask  */


/* -------- TWI_SR : (TWI Offset: 0x20) (R/ 32) Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed (cleared by writing TWI_THR) */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready (cleared by reading TWI_RHR) */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready (cleared by writing TWI_THR) */
    uint32_t SVREAD:1;                  /**< bit:      3  Slave Read                               */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access                             */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access (cleared on read)    */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error (cleared on read)          */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledged (cleared on read)       */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost (cleared on read)       */
    uint32_t SCLWS:1;                   /**< bit:     10  Clock Wait State                         */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access (cleared on read)    */
    uint32_t ENDRX:1;                   /**< bit:     12  End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR) */
    uint32_t ENDTX:1;                   /**< bit:     13  End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR) */
    uint32_t RXBUFF:1;                  /**< bit:     14  RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR) */
    uint32_t TXBUFE:1;                  /**< bit:     15  TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR) */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_SR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_SR_OFFSET                       (0x20)                                        /**<  (TWI_SR) Status Register  Offset */

#define TWI_SR_TXCOMP_Pos                   0                                              /**< (TWI_SR) Transmission Completed (cleared by writing TWI_THR) Position */
#define TWI_SR_TXCOMP_Msk                   (_U_(0x1) << TWI_SR_TXCOMP_Pos)                /**< (TWI_SR) Transmission Completed (cleared by writing TWI_THR) Mask */
#define TWI_SR_TXCOMP                       TWI_SR_TXCOMP_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_TXCOMP_Msk instead */
#define TWI_SR_RXRDY_Pos                    1                                              /**< (TWI_SR) Receive Holding Register Ready (cleared by reading TWI_RHR) Position */
#define TWI_SR_RXRDY_Msk                    (_U_(0x1) << TWI_SR_RXRDY_Pos)                 /**< (TWI_SR) Receive Holding Register Ready (cleared by reading TWI_RHR) Mask */
#define TWI_SR_RXRDY                        TWI_SR_RXRDY_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_RXRDY_Msk instead */
#define TWI_SR_TXRDY_Pos                    2                                              /**< (TWI_SR) Transmit Holding Register Ready (cleared by writing TWI_THR) Position */
#define TWI_SR_TXRDY_Msk                    (_U_(0x1) << TWI_SR_TXRDY_Pos)                 /**< (TWI_SR) Transmit Holding Register Ready (cleared by writing TWI_THR) Mask */
#define TWI_SR_TXRDY                        TWI_SR_TXRDY_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_TXRDY_Msk instead */
#define TWI_SR_SVREAD_Pos                   3                                              /**< (TWI_SR) Slave Read Position */
#define TWI_SR_SVREAD_Msk                   (_U_(0x1) << TWI_SR_SVREAD_Pos)                /**< (TWI_SR) Slave Read Mask */
#define TWI_SR_SVREAD                       TWI_SR_SVREAD_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_SVREAD_Msk instead */
#define TWI_SR_SVACC_Pos                    4                                              /**< (TWI_SR) Slave Access Position */
#define TWI_SR_SVACC_Msk                    (_U_(0x1) << TWI_SR_SVACC_Pos)                 /**< (TWI_SR) Slave Access Mask */
#define TWI_SR_SVACC                        TWI_SR_SVACC_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_SVACC_Msk instead */
#define TWI_SR_GACC_Pos                     5                                              /**< (TWI_SR) General Call Access (cleared on read) Position */
#define TWI_SR_GACC_Msk                     (_U_(0x1) << TWI_SR_GACC_Pos)                  /**< (TWI_SR) General Call Access (cleared on read) Mask */
#define TWI_SR_GACC                         TWI_SR_GACC_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_GACC_Msk instead */
#define TWI_SR_OVRE_Pos                     6                                              /**< (TWI_SR) Overrun Error (cleared on read) Position */
#define TWI_SR_OVRE_Msk                     (_U_(0x1) << TWI_SR_OVRE_Pos)                  /**< (TWI_SR) Overrun Error (cleared on read) Mask */
#define TWI_SR_OVRE                         TWI_SR_OVRE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_OVRE_Msk instead */
#define TWI_SR_NACK_Pos                     8                                              /**< (TWI_SR) Not Acknowledged (cleared on read) Position */
#define TWI_SR_NACK_Msk                     (_U_(0x1) << TWI_SR_NACK_Pos)                  /**< (TWI_SR) Not Acknowledged (cleared on read) Mask */
#define TWI_SR_NACK                         TWI_SR_NACK_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_NACK_Msk instead */
#define TWI_SR_ARBLST_Pos                   9                                              /**< (TWI_SR) Arbitration Lost (cleared on read) Position */
#define TWI_SR_ARBLST_Msk                   (_U_(0x1) << TWI_SR_ARBLST_Pos)                /**< (TWI_SR) Arbitration Lost (cleared on read) Mask */
#define TWI_SR_ARBLST                       TWI_SR_ARBLST_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_ARBLST_Msk instead */
#define TWI_SR_SCLWS_Pos                    10                                             /**< (TWI_SR) Clock Wait State Position */
#define TWI_SR_SCLWS_Msk                    (_U_(0x1) << TWI_SR_SCLWS_Pos)                 /**< (TWI_SR) Clock Wait State Mask */
#define TWI_SR_SCLWS                        TWI_SR_SCLWS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_SCLWS_Msk instead */
#define TWI_SR_EOSACC_Pos                   11                                             /**< (TWI_SR) End Of Slave Access (cleared on read) Position */
#define TWI_SR_EOSACC_Msk                   (_U_(0x1) << TWI_SR_EOSACC_Pos)                /**< (TWI_SR) End Of Slave Access (cleared on read) Mask */
#define TWI_SR_EOSACC                       TWI_SR_EOSACC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_EOSACC_Msk instead */
#define TWI_SR_ENDRX_Pos                    12                                             /**< (TWI_SR) End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR) Position */
#define TWI_SR_ENDRX_Msk                    (_U_(0x1) << TWI_SR_ENDRX_Pos)                 /**< (TWI_SR) End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR) Mask */
#define TWI_SR_ENDRX                        TWI_SR_ENDRX_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_ENDRX_Msk instead */
#define TWI_SR_ENDTX_Pos                    13                                             /**< (TWI_SR) End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR) Position */
#define TWI_SR_ENDTX_Msk                    (_U_(0x1) << TWI_SR_ENDTX_Pos)                 /**< (TWI_SR) End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR) Mask */
#define TWI_SR_ENDTX                        TWI_SR_ENDTX_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_ENDTX_Msk instead */
#define TWI_SR_RXBUFF_Pos                   14                                             /**< (TWI_SR) RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR) Position */
#define TWI_SR_RXBUFF_Msk                   (_U_(0x1) << TWI_SR_RXBUFF_Pos)                /**< (TWI_SR) RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR) Mask */
#define TWI_SR_RXBUFF                       TWI_SR_RXBUFF_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_RXBUFF_Msk instead */
#define TWI_SR_TXBUFE_Pos                   15                                             /**< (TWI_SR) TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR) Position */
#define TWI_SR_TXBUFE_Msk                   (_U_(0x1) << TWI_SR_TXBUFE_Pos)                /**< (TWI_SR) TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR) Mask */
#define TWI_SR_TXBUFE                       TWI_SR_TXBUFE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_SR_TXBUFE_Msk instead */
#define TWI_SR_MASK                         _U_(0xFF7F)                                    /**< \deprecated (TWI_SR) Register MASK  (Use TWI_SR_Msk instead)  */
#define TWI_SR_Msk                          _U_(0xFF7F)                                    /**< (TWI_SR) Register Mask  */


/* -------- TWI_IER : (TWI Offset: 0x24) (/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed Interrupt Enable  */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready Interrupt Enable */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready Interrupt Enable */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access Interrupt Enable            */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access Interrupt Enable     */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error Interrupt Enable           */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledge Interrupt Enable         */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost Interrupt Enable        */
    uint32_t SCL_WS:1;                  /**< bit:     10  Clock Wait State Interrupt Enable        */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access Interrupt Enable     */
    uint32_t ENDRX:1;                   /**< bit:     12  End of Receive Buffer Interrupt Enable   */
    uint32_t ENDTX:1;                   /**< bit:     13  End of Transmit Buffer Interrupt Enable  */
    uint32_t RXBUFF:1;                  /**< bit:     14  Receive Buffer Full Interrupt Enable     */
    uint32_t TXBUFE:1;                  /**< bit:     15  Transmit Buffer Empty Interrupt Enable   */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_IER_Type;
