ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_IER_OFFSET                      (0x24)                                        /**<  (TWI_IER) Interrupt Enable Register  Offset */

#define TWI_IER_TXCOMP_Pos                  0                                              /**< (TWI_IER) Transmission Completed Interrupt Enable Position */
#define TWI_IER_TXCOMP_Msk                  (_U_(0x1) << TWI_IER_TXCOMP_Pos)               /**< (TWI_IER) Transmission Completed Interrupt Enable Mask */
#define TWI_IER_TXCOMP                      TWI_IER_TXCOMP_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_TXCOMP_Msk instead */
#define TWI_IER_RXRDY_Pos                   1                                              /**< (TWI_IER) Receive Holding Register Ready Interrupt Enable Position */
#define TWI_IER_RXRDY_Msk                   (_U_(0x1) << TWI_IER_RXRDY_Pos)                /**< (TWI_IER) Receive Holding Register Ready Interrupt Enable Mask */
#define TWI_IER_RXRDY                       TWI_IER_RXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_RXRDY_Msk instead */
#define TWI_IER_TXRDY_Pos                   2                                              /**< (TWI_IER) Transmit Holding Register Ready Interrupt Enable Position */
#define TWI_IER_TXRDY_Msk                   (_U_(0x1) << TWI_IER_TXRDY_Pos)                /**< (TWI_IER) Transmit Holding Register Ready Interrupt Enable Mask */
#define TWI_IER_TXRDY                       TWI_IER_TXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_TXRDY_Msk instead */
#define TWI_IER_SVACC_Pos                   4                                              /**< (TWI_IER) Slave Access Interrupt Enable Position */
#define TWI_IER_SVACC_Msk                   (_U_(0x1) << TWI_IER_SVACC_Pos)                /**< (TWI_IER) Slave Access Interrupt Enable Mask */
#define TWI_IER_SVACC                       TWI_IER_SVACC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_SVACC_Msk instead */
#define TWI_IER_GACC_Pos                    5                                              /**< (TWI_IER) General Call Access Interrupt Enable Position */
#define TWI_IER_GACC_Msk                    (_U_(0x1) << TWI_IER_GACC_Pos)                 /**< (TWI_IER) General Call Access Interrupt Enable Mask */
#define TWI_IER_GACC                        TWI_IER_GACC_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_GACC_Msk instead */
#define TWI_IER_OVRE_Pos                    6                                              /**< (TWI_IER) Overrun Error Interrupt Enable Position */
#define TWI_IER_OVRE_Msk                    (_U_(0x1) << TWI_IER_OVRE_Pos)                 /**< (TWI_IER) Overrun Error Interrupt Enable Mask */
#define TWI_IER_OVRE                        TWI_IER_OVRE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_OVRE_Msk instead */
#define TWI_IER_NACK_Pos                    8                                              /**< (TWI_IER) Not Acknowledge Interrupt Enable Position */
#define TWI_IER_NACK_Msk                    (_U_(0x1) << TWI_IER_NACK_Pos)                 /**< (TWI_IER) Not Acknowledge Interrupt Enable Mask */
#define TWI_IER_NACK                        TWI_IER_NACK_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_NACK_Msk instead */
#define TWI_IER_ARBLST_Pos                  9                                              /**< (TWI_IER) Arbitration Lost Interrupt Enable Position */
#define TWI_IER_ARBLST_Msk                  (_U_(0x1) << TWI_IER_ARBLST_Pos)               /**< (TWI_IER) Arbitration Lost Interrupt Enable Mask */
#define TWI_IER_ARBLST                      TWI_IER_ARBLST_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_ARBLST_Msk instead */
#define TWI_IER_SCL_WS_Pos                  10                                             /**< (TWI_IER) Clock Wait State Interrupt Enable Position */
#define TWI_IER_SCL_WS_Msk                  (_U_(0x1) << TWI_IER_SCL_WS_Pos)               /**< (TWI_IER) Clock Wait State Interrupt Enable Mask */
#define TWI_IER_SCL_WS                      TWI_IER_SCL_WS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_SCL_WS_Msk instead */
#define TWI_IER_EOSACC_Pos                  11                                             /**< (TWI_IER) End Of Slave Access Interrupt Enable Position */
#define TWI_IER_EOSACC_Msk                  (_U_(0x1) << TWI_IER_EOSACC_Pos)               /**< (TWI_IER) End Of Slave Access Interrupt Enable Mask */
#define TWI_IER_EOSACC                      TWI_IER_EOSACC_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_EOSACC_Msk instead */
#define TWI_IER_ENDRX_Pos                   12                                             /**< (TWI_IER) End of Receive Buffer Interrupt Enable Position */
#define TWI_IER_ENDRX_Msk                   (_U_(0x1) << TWI_IER_ENDRX_Pos)                /**< (TWI_IER) End of Receive Buffer Interrupt Enable Mask */
#define TWI_IER_ENDRX                       TWI_IER_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_ENDRX_Msk instead */
#define TWI_IER_ENDTX_Pos                   13                                             /**< (TWI_IER) End of Transmit Buffer Interrupt Enable Position */
#define TWI_IER_ENDTX_Msk                   (_U_(0x1) << TWI_IER_ENDTX_Pos)                /**< (TWI_IER) End of Transmit Buffer Interrupt Enable Mask */
#define TWI_IER_ENDTX                       TWI_IER_ENDTX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_ENDTX_Msk instead */
#define TWI_IER_RXBUFF_Pos                  14                                             /**< (TWI_IER) Receive Buffer Full Interrupt Enable Position */
#define TWI_IER_RXBUFF_Msk                  (_U_(0x1) << TWI_IER_RXBUFF_Pos)               /**< (TWI_IER) Receive Buffer Full Interrupt Enable Mask */
#define TWI_IER_RXBUFF                      TWI_IER_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_RXBUFF_Msk instead */
#define TWI_IER_TXBUFE_Pos                  15                                             /**< (TWI_IER) Transmit Buffer Empty Interrupt Enable Position */
#define TWI_IER_TXBUFE_Msk                  (_U_(0x1) << TWI_IER_TXBUFE_Pos)               /**< (TWI_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define TWI_IER_TXBUFE                      TWI_IER_TXBUFE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IER_TXBUFE_Msk instead */
#define TWI_IER_MASK                        _U_(0xFF77)                                    /**< \deprecated (TWI_IER) Register MASK  (Use TWI_IER_Msk instead)  */
#define TWI_IER_Msk                         _U_(0xFF77)                                    /**< (TWI_IER) Register Mask  */


/* -------- TWI_IDR : (TWI Offset: 0x28) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed Interrupt Disable */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready Interrupt Disable */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready Interrupt Disable */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access Interrupt Disable           */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access Interrupt Disable    */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error Interrupt Disable          */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledge Interrupt Disable        */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost Interrupt Disable       */
    uint32_t SCL_WS:1;                  /**< bit:     10  Clock Wait State Interrupt Disable       */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access Interrupt Disable    */
    uint32_t ENDRX:1;                   /**< bit:     12  End of Receive Buffer Interrupt Disable  */
    uint32_t ENDTX:1;                   /**< bit:     13  End of Transmit Buffer Interrupt Disable */
    uint32_t RXBUFF:1;                  /**< bit:     14  Receive Buffer Full Interrupt Disable    */
    uint32_t TXBUFE:1;                  /**< bit:     15  Transmit Buffer Empty Interrupt Disable  */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_IDR_Type;
