ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_IDR_OFFSET                      (0x28)                                        /**<  (TWI_IDR) Interrupt Disable Register  Offset */

#define TWI_IDR_TXCOMP_Pos                  0                                              /**< (TWI_IDR) Transmission Completed Interrupt Disable Position */
#define TWI_IDR_TXCOMP_Msk                  (_U_(0x1) << TWI_IDR_TXCOMP_Pos)               /**< (TWI_IDR) Transmission Completed Interrupt Disable Mask */
#define TWI_IDR_TXCOMP                      TWI_IDR_TXCOMP_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_TXCOMP_Msk instead */
#define TWI_IDR_RXRDY_Pos                   1                                              /**< (TWI_IDR) Receive Holding Register Ready Interrupt Disable Position */
#define TWI_IDR_RXRDY_Msk                   (_U_(0x1) << TWI_IDR_RXRDY_Pos)                /**< (TWI_IDR) Receive Holding Register Ready Interrupt Disable Mask */
#define TWI_IDR_RXRDY                       TWI_IDR_RXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_RXRDY_Msk instead */
#define TWI_IDR_TXRDY_Pos                   2                                              /**< (TWI_IDR) Transmit Holding Register Ready Interrupt Disable Position */
#define TWI_IDR_TXRDY_Msk                   (_U_(0x1) << TWI_IDR_TXRDY_Pos)                /**< (TWI_IDR) Transmit Holding Register Ready Interrupt Disable Mask */
#define TWI_IDR_TXRDY                       TWI_IDR_TXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_TXRDY_Msk instead */
#define TWI_IDR_SVACC_Pos                   4                                              /**< (TWI_IDR) Slave Access Interrupt Disable Position */
#define TWI_IDR_SVACC_Msk                   (_U_(0x1) << TWI_IDR_SVACC_Pos)                /**< (TWI_IDR) Slave Access Interrupt Disable Mask */
#define TWI_IDR_SVACC                       TWI_IDR_SVACC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_SVACC_Msk instead */
#define TWI_IDR_GACC_Pos                    5                                              /**< (TWI_IDR) General Call Access Interrupt Disable Position */
#define TWI_IDR_GACC_Msk                    (_U_(0x1) << TWI_IDR_GACC_Pos)                 /**< (TWI_IDR) General Call Access Interrupt Disable Mask */
#define TWI_IDR_GACC                        TWI_IDR_GACC_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_GACC_Msk instead */
#define TWI_IDR_OVRE_Pos                    6                                              /**< (TWI_IDR) Overrun Error Interrupt Disable Position */
#define TWI_IDR_OVRE_Msk                    (_U_(0x1) << TWI_IDR_OVRE_Pos)                 /**< (TWI_IDR) Overrun Error Interrupt Disable Mask */
#define TWI_IDR_OVRE                        TWI_IDR_OVRE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_OVRE_Msk instead */
#define TWI_IDR_NACK_Pos                    8                                              /**< (TWI_IDR) Not Acknowledge Interrupt Disable Position */
#define TWI_IDR_NACK_Msk                    (_U_(0x1) << TWI_IDR_NACK_Pos)                 /**< (TWI_IDR) Not Acknowledge Interrupt Disable Mask */
#define TWI_IDR_NACK                        TWI_IDR_NACK_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_NACK_Msk instead */
#define TWI_IDR_ARBLST_Pos                  9                                              /**< (TWI_IDR) Arbitration Lost Interrupt Disable Position */
#define TWI_IDR_ARBLST_Msk                  (_U_(0x1) << TWI_IDR_ARBLST_Pos)               /**< (TWI_IDR) Arbitration Lost Interrupt Disable Mask */
#define TWI_IDR_ARBLST                      TWI_IDR_ARBLST_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_ARBLST_Msk instead */
#define TWI_IDR_SCL_WS_Pos                  10                                             /**< (TWI_IDR) Clock Wait State Interrupt Disable Position */
#define TWI_IDR_SCL_WS_Msk                  (_U_(0x1) << TWI_IDR_SCL_WS_Pos)               /**< (TWI_IDR) Clock Wait State Interrupt Disable Mask */
#define TWI_IDR_SCL_WS                      TWI_IDR_SCL_WS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_SCL_WS_Msk instead */
#define TWI_IDR_EOSACC_Pos                  11                                             /**< (TWI_IDR) End Of Slave Access Interrupt Disable Position */
#define TWI_IDR_EOSACC_Msk                  (_U_(0x1) << TWI_IDR_EOSACC_Pos)               /**< (TWI_IDR) End Of Slave Access Interrupt Disable Mask */
#define TWI_IDR_EOSACC                      TWI_IDR_EOSACC_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_EOSACC_Msk instead */
#define TWI_IDR_ENDRX_Pos                   12                                             /**< (TWI_IDR) End of Receive Buffer Interrupt Disable Position */
#define TWI_IDR_ENDRX_Msk                   (_U_(0x1) << TWI_IDR_ENDRX_Pos)                /**< (TWI_IDR) End of Receive Buffer Interrupt Disable Mask */
#define TWI_IDR_ENDRX                       TWI_IDR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_ENDRX_Msk instead */
#define TWI_IDR_ENDTX_Pos                   13                                             /**< (TWI_IDR) End of Transmit Buffer Interrupt Disable Position */
#define TWI_IDR_ENDTX_Msk                   (_U_(0x1) << TWI_IDR_ENDTX_Pos)                /**< (TWI_IDR) End of Transmit Buffer Interrupt Disable Mask */
#define TWI_IDR_ENDTX                       TWI_IDR_ENDTX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_ENDTX_Msk instead */
#define TWI_IDR_RXBUFF_Pos                  14                                             /**< (TWI_IDR) Receive Buffer Full Interrupt Disable Position */
#define TWI_IDR_RXBUFF_Msk                  (_U_(0x1) << TWI_IDR_RXBUFF_Pos)               /**< (TWI_IDR) Receive Buffer Full Interrupt Disable Mask */
#define TWI_IDR_RXBUFF                      TWI_IDR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_RXBUFF_Msk instead */
#define TWI_IDR_TXBUFE_Pos                  15                                             /**< (TWI_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define TWI_IDR_TXBUFE_Msk                  (_U_(0x1) << TWI_IDR_TXBUFE_Pos)               /**< (TWI_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define TWI_IDR_TXBUFE                      TWI_IDR_TXBUFE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IDR_TXBUFE_Msk instead */
#define TWI_IDR_MASK                        _U_(0xFF77)                                    /**< \deprecated (TWI_IDR) Register MASK  (Use TWI_IDR_Msk instead)  */
#define TWI_IDR_Msk                         _U_(0xFF77)                                    /**< (TWI_IDR) Register Mask  */


/* -------- TWI_IMR : (TWI Offset: 0x2c) (R/ 32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed Interrupt Mask    */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready Interrupt Mask */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready Interrupt Mask */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access Interrupt Mask              */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access Interrupt Mask       */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error Interrupt Mask             */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledge Interrupt Mask           */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost Interrupt Mask          */
    uint32_t SCL_WS:1;                  /**< bit:     10  Clock Wait State Interrupt Mask          */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access Interrupt Mask       */
    uint32_t ENDRX:1;                   /**< bit:     12  End of Receive Buffer Interrupt Mask     */
    uint32_t ENDTX:1;                   /**< bit:     13  End of Transmit Buffer Interrupt Mask    */
    uint32_t RXBUFF:1;                  /**< bit:     14  Receive Buffer Full Interrupt Mask       */
    uint32_t TXBUFE:1;                  /**< bit:     15  Transmit Buffer Empty Interrupt Mask     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_IMR_Type;
