ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_IMR_OFFSET                      (0x2C)                                        /**<  (TWI_IMR) Interrupt Mask Register  Offset */

#define TWI_IMR_TXCOMP_Pos                  0                                              /**< (TWI_IMR) Transmission Completed Interrupt Mask Position */
#define TWI_IMR_TXCOMP_Msk                  (_U_(0x1) << TWI_IMR_TXCOMP_Pos)               /**< (TWI_IMR) Transmission Completed Interrupt Mask Mask */
#define TWI_IMR_TXCOMP                      TWI_IMR_TXCOMP_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_TXCOMP_Msk instead */
#define TWI_IMR_RXRDY_Pos                   1                                              /**< (TWI_IMR) Receive Holding Register Ready Interrupt Mask Position */
#define TWI_IMR_RXRDY_Msk                   (_U_(0x1) << TWI_IMR_RXRDY_Pos)                /**< (TWI_IMR) Receive Holding Register Ready Interrupt Mask Mask */
#define TWI_IMR_RXRDY                       TWI_IMR_RXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_RXRDY_Msk instead */
#define TWI_IMR_TXRDY_Pos                   2                                              /**< (TWI_IMR) Transmit Holding Register Ready Interrupt Mask Position */
#define TWI_IMR_TXRDY_Msk                   (_U_(0x1) << TWI_IMR_TXRDY_Pos)                /**< (TWI_IMR) Transmit Holding Register Ready Interrupt Mask Mask */
#define TWI_IMR_TXRDY                       TWI_IMR_TXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_TXRDY_Msk instead */
#define TWI_IMR_SVACC_Pos                   4                                              /**< (TWI_IMR) Slave Access Interrupt Mask Position */
#define TWI_IMR_SVACC_Msk                   (_U_(0x1) << TWI_IMR_SVACC_Pos)                /**< (TWI_IMR) Slave Access Interrupt Mask Mask */
#define TWI_IMR_SVACC                       TWI_IMR_SVACC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_SVACC_Msk instead */
#define TWI_IMR_GACC_Pos                    5                                              /**< (TWI_IMR) General Call Access Interrupt Mask Position */
#define TWI_IMR_GACC_Msk                    (_U_(0x1) << TWI_IMR_GACC_Pos)                 /**< (TWI_IMR) General Call Access Interrupt Mask Mask */
#define TWI_IMR_GACC                        TWI_IMR_GACC_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_GACC_Msk instead */
#define TWI_IMR_OVRE_Pos                    6                                              /**< (TWI_IMR) Overrun Error Interrupt Mask Position */
#define TWI_IMR_OVRE_Msk                    (_U_(0x1) << TWI_IMR_OVRE_Pos)                 /**< (TWI_IMR) Overrun Error Interrupt Mask Mask */
#define TWI_IMR_OVRE                        TWI_IMR_OVRE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_OVRE_Msk instead */
#define TWI_IMR_NACK_Pos                    8                                              /**< (TWI_IMR) Not Acknowledge Interrupt Mask Position */
#define TWI_IMR_NACK_Msk                    (_U_(0x1) << TWI_IMR_NACK_Pos)                 /**< (TWI_IMR) Not Acknowledge Interrupt Mask Mask */
#define TWI_IMR_NACK                        TWI_IMR_NACK_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_NACK_Msk instead */
#define TWI_IMR_ARBLST_Pos                  9                                              /**< (TWI_IMR) Arbitration Lost Interrupt Mask Position */
#define TWI_IMR_ARBLST_Msk                  (_U_(0x1) << TWI_IMR_ARBLST_Pos)               /**< (TWI_IMR) Arbitration Lost Interrupt Mask Mask */
#define TWI_IMR_ARBLST                      TWI_IMR_ARBLST_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_ARBLST_Msk instead */
#define TWI_IMR_SCL_WS_Pos                  10                                             /**< (TWI_IMR) Clock Wait State Interrupt Mask Position */
#define TWI_IMR_SCL_WS_Msk                  (_U_(0x1) << TWI_IMR_SCL_WS_Pos)               /**< (TWI_IMR) Clock Wait State Interrupt Mask Mask */
#define TWI_IMR_SCL_WS                      TWI_IMR_SCL_WS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_SCL_WS_Msk instead */
#define TWI_IMR_EOSACC_Pos                  11                                             /**< (TWI_IMR) End Of Slave Access Interrupt Mask Position */
#define TWI_IMR_EOSACC_Msk                  (_U_(0x1) << TWI_IMR_EOSACC_Pos)               /**< (TWI_IMR) End Of Slave Access Interrupt Mask Mask */
#define TWI_IMR_EOSACC                      TWI_IMR_EOSACC_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_EOSACC_Msk instead */
#define TWI_IMR_ENDRX_Pos                   12                                             /**< (TWI_IMR) End of Receive Buffer Interrupt Mask Position */
#define TWI_IMR_ENDRX_Msk                   (_U_(0x1) << TWI_IMR_ENDRX_Pos)                /**< (TWI_IMR) End of Receive Buffer Interrupt Mask Mask */
#define TWI_IMR_ENDRX                       TWI_IMR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_ENDRX_Msk instead */
#define TWI_IMR_ENDTX_Pos                   13                                             /**< (TWI_IMR) End of Transmit Buffer Interrupt Mask Position */
#define TWI_IMR_ENDTX_Msk                   (_U_(0x1) << TWI_IMR_ENDTX_Pos)                /**< (TWI_IMR) End of Transmit Buffer Interrupt Mask Mask */
#define TWI_IMR_ENDTX                       TWI_IMR_ENDTX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_ENDTX_Msk instead */
#define TWI_IMR_RXBUFF_Pos                  14                                             /**< (TWI_IMR) Receive Buffer Full Interrupt Mask Position */
#define TWI_IMR_RXBUFF_Msk                  (_U_(0x1) << TWI_IMR_RXBUFF_Pos)               /**< (TWI_IMR) Receive Buffer Full Interrupt Mask Mask */
#define TWI_IMR_RXBUFF                      TWI_IMR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_RXBUFF_Msk instead */
#define TWI_IMR_TXBUFE_Pos                  15                                             /**< (TWI_IMR) Transmit Buffer Empty Interrupt Mask Position */
#define TWI_IMR_TXBUFE_Msk                  (_U_(0x1) << TWI_IMR_TXBUFE_Pos)               /**< (TWI_IMR) Transmit Buffer Empty Interrupt Mask Mask */
#define TWI_IMR_TXBUFE                      TWI_IMR_TXBUFE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_IMR_TXBUFE_Msk instead */
#define TWI_IMR_MASK                        _U_(0xFF77)                                    /**< \deprecated (TWI_IMR) Register MASK  (Use TWI_IMR_Msk instead)  */
#define TWI_IMR_Msk                         _U_(0xFF77)                                    /**< (TWI_IMR) Register Mask  */


