ataradov/mcu-starter-projects/samg53/include/component/twi.h
/* -------- TWI_RHR : (TWI Offset: 0x30) (R/ 32) Receive Holding Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXDATA:8;                  /**< bit:   0..7  Master or Slave Receive Holding Data     */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_RHR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_RHR_OFFSET                      (0x30)                                        /**<  (TWI_RHR) Receive Holding Register  Offset */

#define TWI_RHR_RXDATA_Pos                  0                                              /**< (TWI_RHR) Master or Slave Receive Holding Data Position */
#define TWI_RHR_RXDATA_Msk                  (_U_(0xFF) << TWI_RHR_RXDATA_Pos)              /**< (TWI_RHR) Master or Slave Receive Holding Data Mask */
#define TWI_RHR_RXDATA(value)               (TWI_RHR_RXDATA_Msk & ((value) << TWI_RHR_RXDATA_Pos))
#define TWI_RHR_MASK                        _U_(0xFF)                                      /**< \deprecated (TWI_RHR) Register MASK  (Use TWI_RHR_Msk instead)  */
#define TWI_RHR_Msk                         _U_(0xFF)                                      /**< (TWI_RHR) Register Mask  */


/* -------- TWI_THR : (TWI Offset: 0x34) (/W 32) Transmit Holding Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXDATA:8;                  /**< bit:   0..7  Master or Slave Transmit Holding Data    */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_THR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_THR_OFFSET                      (0x34)                                        /**<  (TWI_THR) Transmit Holding Register  Offset */

#define TWI_THR_TXDATA_Pos                  0                                              /**< (TWI_THR) Master or Slave Transmit Holding Data Position */
#define TWI_THR_TXDATA_Msk                  (_U_(0xFF) << TWI_THR_TXDATA_Pos)              /**< (TWI_THR) Master or Slave Transmit Holding Data Mask */
#define TWI_THR_TXDATA(value)               (TWI_THR_TXDATA_Msk & ((value) << TWI_THR_TXDATA_Pos))
#define TWI_THR_MASK                        _U_(0xFF)                                      /**< \deprecated (TWI_THR) Register MASK  (Use TWI_THR_Msk instead)  */
#define TWI_THR_Msk                         _U_(0xFF)                                      /**< (TWI_THR) Register Mask  */


/* -------- TWI_WPMR : (TWI Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                  */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_WPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_WPMR_OFFSET                     (0xE4)                                        /**<  (TWI_WPMR) Write Protection Mode Register  Offset */

#define TWI_WPMR_WPEN_Pos                   0                                              /**< (TWI_WPMR) Write Protection Enable Position */
#define TWI_WPMR_WPEN_Msk                   (_U_(0x1) << TWI_WPMR_WPEN_Pos)                /**< (TWI_WPMR) Write Protection Enable Mask */
#define TWI_WPMR_WPEN                       TWI_WPMR_WPEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_WPMR_WPEN_Msk instead */
#define TWI_WPMR_WPKEY_Pos                  8                                              /**< (TWI_WPMR) Write Protection Key Position */
#define TWI_WPMR_WPKEY_Msk                  (_U_(0xFFFFFF) << TWI_WPMR_WPKEY_Pos)          /**< (TWI_WPMR) Write Protection Key Mask */
#define TWI_WPMR_WPKEY(value)               (TWI_WPMR_WPKEY_Msk & ((value) << TWI_WPMR_WPKEY_Pos))
#define   TWI_WPMR_WPKEY_PASSWD_Val         _U_(0x545749)                                  /**< (TWI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define TWI_WPMR_WPKEY_PASSWD               (TWI_WPMR_WPKEY_PASSWD_Val << TWI_WPMR_WPKEY_Pos)  /**< (TWI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define TWI_WPMR_MASK                       _U_(0xFFFFFF01)                                /**< \deprecated (TWI_WPMR) Register MASK  (Use TWI_WPMR_Msk instead)  */
#define TWI_WPMR_Msk                        _U_(0xFFFFFF01)                                /**< (TWI_WPMR) Register Mask  */


/* -------- TWI_WPSR : (TWI Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status        */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPVSRC:24;                 /**< bit:  8..31  Write Protection Violation Source        */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_WPSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

