ataradov/mcu-starter-projects/samg53/include/component/twi.h
#define TWI_WPSR_OFFSET                     (0xE8)                                        /**<  (TWI_WPSR) Write Protection Status Register  Offset */

#define TWI_WPSR_WPVS_Pos                   0                                              /**< (TWI_WPSR) Write Protection Violation Status Position */
#define TWI_WPSR_WPVS_Msk                   (_U_(0x1) << TWI_WPSR_WPVS_Pos)                /**< (TWI_WPSR) Write Protection Violation Status Mask */
#define TWI_WPSR_WPVS                       TWI_WPSR_WPVS_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_WPSR_WPVS_Msk instead */
#define TWI_WPSR_WPVSRC_Pos                 8                                              /**< (TWI_WPSR) Write Protection Violation Source Position */
#define TWI_WPSR_WPVSRC_Msk                 (_U_(0xFFFFFF) << TWI_WPSR_WPVSRC_Pos)         /**< (TWI_WPSR) Write Protection Violation Source Mask */
#define TWI_WPSR_WPVSRC(value)              (TWI_WPSR_WPVSRC_Msk & ((value) << TWI_WPSR_WPVSRC_Pos))
#define TWI_WPSR_MASK                       _U_(0xFFFFFF01)                                /**< \deprecated (TWI_WPSR) Register MASK  (Use TWI_WPSR_Msk instead)  */
#define TWI_WPSR_Msk                        _U_(0xFFFFFF01)                                /**< (TWI_WPSR) Register Mask  */


/* -------- TWI_RPR : (TWI Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXPTR:32;                  /**< bit:  0..31  Receive Pointer Register                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_RPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_RPR_OFFSET                      (0x100)                                       /**<  (TWI_RPR) Receive Pointer Register  Offset */

#define TWI_RPR_RXPTR_Pos                   0                                              /**< (TWI_RPR) Receive Pointer Register Position */
#define TWI_RPR_RXPTR_Msk                   (_U_(0xFFFFFFFF) << TWI_RPR_RXPTR_Pos)         /**< (TWI_RPR) Receive Pointer Register Mask */
#define TWI_RPR_RXPTR(value)                (TWI_RPR_RXPTR_Msk & ((value) << TWI_RPR_RXPTR_Pos))
#define TWI_RPR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (TWI_RPR) Register MASK  (Use TWI_RPR_Msk instead)  */
#define TWI_RPR_Msk                         _U_(0xFFFFFFFF)                                /**< (TWI_RPR) Register Mask  */


/* -------- TWI_RCR : (TWI Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_RCR_OFFSET                      (0x104)                                       /**<  (TWI_RCR) Receive Counter Register  Offset */

#define TWI_RCR_RXCTR_Pos                   0                                              /**< (TWI_RCR) Receive Counter Register Position */
#define TWI_RCR_RXCTR_Msk                   (_U_(0xFFFF) << TWI_RCR_RXCTR_Pos)             /**< (TWI_RCR) Receive Counter Register Mask */
#define TWI_RCR_RXCTR(value)                (TWI_RCR_RXCTR_Msk & ((value) << TWI_RCR_RXCTR_Pos))
#define TWI_RCR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (TWI_RCR) Register MASK  (Use TWI_RCR_Msk instead)  */
#define TWI_RCR_Msk                         _U_(0xFFFF)                                    /**< (TWI_RCR) Register Mask  */


/* -------- TWI_TPR : (TWI Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXPTR:32;                  /**< bit:  0..31  Transmit Counter Register                */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_TPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_TPR_OFFSET                      (0x108)                                       /**<  (TWI_TPR) Transmit Pointer Register  Offset */

#define TWI_TPR_TXPTR_Pos                   0                                              /**< (TWI_TPR) Transmit Counter Register Position */
#define TWI_TPR_TXPTR_Msk                   (_U_(0xFFFFFFFF) << TWI_TPR_TXPTR_Pos)         /**< (TWI_TPR) Transmit Counter Register Mask */
#define TWI_TPR_TXPTR(value)                (TWI_TPR_TXPTR_Msk & ((value) << TWI_TPR_TXPTR_Pos))
#define TWI_TPR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (TWI_TPR) Register MASK  (Use TWI_TPR_Msk instead)  */
#define TWI_TPR_Msk                         _U_(0xFFFFFFFF)                                /**< (TWI_TPR) Register Mask  */


/* -------- TWI_TCR : (TWI Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_TCR_Type;
