ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_PTCR_OFFSET                     (0x120)                                       /**<  (TWI_PTCR) Transfer Control Register  Offset */

#define TWI_PTCR_RXTEN_Pos                  0                                              /**< (TWI_PTCR) Receiver Transfer Enable Position */
#define TWI_PTCR_RXTEN_Msk                  (_U_(0x1) << TWI_PTCR_RXTEN_Pos)               /**< (TWI_PTCR) Receiver Transfer Enable Mask */
#define TWI_PTCR_RXTEN                      TWI_PTCR_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_RXTEN_Msk instead */
#define TWI_PTCR_RXTDIS_Pos                 1                                              /**< (TWI_PTCR) Receiver Transfer Disable Position */
#define TWI_PTCR_RXTDIS_Msk                 (_U_(0x1) << TWI_PTCR_RXTDIS_Pos)              /**< (TWI_PTCR) Receiver Transfer Disable Mask */
#define TWI_PTCR_RXTDIS                     TWI_PTCR_RXTDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_RXTDIS_Msk instead */
#define TWI_PTCR_TXTEN_Pos                  8                                              /**< (TWI_PTCR) Transmitter Transfer Enable Position */
#define TWI_PTCR_TXTEN_Msk                  (_U_(0x1) << TWI_PTCR_TXTEN_Pos)               /**< (TWI_PTCR) Transmitter Transfer Enable Mask */
#define TWI_PTCR_TXTEN                      TWI_PTCR_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_TXTEN_Msk instead */
#define TWI_PTCR_TXTDIS_Pos                 9                                              /**< (TWI_PTCR) Transmitter Transfer Disable Position */
#define TWI_PTCR_TXTDIS_Msk                 (_U_(0x1) << TWI_PTCR_TXTDIS_Pos)              /**< (TWI_PTCR) Transmitter Transfer Disable Mask */
#define TWI_PTCR_TXTDIS                     TWI_PTCR_TXTDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_TXTDIS_Msk instead */
#define TWI_PTCR_RXCBEN_Pos                 16                                             /**< (TWI_PTCR) Receiver Circular Buffer Enable Position */
#define TWI_PTCR_RXCBEN_Msk                 (_U_(0x1) << TWI_PTCR_RXCBEN_Pos)              /**< (TWI_PTCR) Receiver Circular Buffer Enable Mask */
#define TWI_PTCR_RXCBEN                     TWI_PTCR_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_RXCBEN_Msk instead */
#define TWI_PTCR_RXCBDIS_Pos                17                                             /**< (TWI_PTCR) Receiver Circular Buffer Disable Position */
#define TWI_PTCR_RXCBDIS_Msk                (_U_(0x1) << TWI_PTCR_RXCBDIS_Pos)             /**< (TWI_PTCR) Receiver Circular Buffer Disable Mask */
#define TWI_PTCR_RXCBDIS                    TWI_PTCR_RXCBDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_RXCBDIS_Msk instead */
#define TWI_PTCR_TXCBEN_Pos                 18                                             /**< (TWI_PTCR) Transmitter Circular Buffer Enable Position */
#define TWI_PTCR_TXCBEN_Msk                 (_U_(0x1) << TWI_PTCR_TXCBEN_Pos)              /**< (TWI_PTCR) Transmitter Circular Buffer Enable Mask */
#define TWI_PTCR_TXCBEN                     TWI_PTCR_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_TXCBEN_Msk instead */
#define TWI_PTCR_TXCBDIS_Pos                19                                             /**< (TWI_PTCR) Transmitter Circular Buffer Disable Position */
#define TWI_PTCR_TXCBDIS_Msk                (_U_(0x1) << TWI_PTCR_TXCBDIS_Pos)             /**< (TWI_PTCR) Transmitter Circular Buffer Disable Mask */
#define TWI_PTCR_TXCBDIS                    TWI_PTCR_TXCBDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_TXCBDIS_Msk instead */
#define TWI_PTCR_ERRCLR_Pos                 24                                             /**< (TWI_PTCR) Transfer Bus Error Clear Position */
#define TWI_PTCR_ERRCLR_Msk                 (_U_(0x1) << TWI_PTCR_ERRCLR_Pos)              /**< (TWI_PTCR) Transfer Bus Error Clear Mask */
#define TWI_PTCR_ERRCLR                     TWI_PTCR_ERRCLR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTCR_ERRCLR_Msk instead */
#define TWI_PTCR_MASK                       _U_(0x10F0303)                                 /**< \deprecated (TWI_PTCR) Register MASK  (Use TWI_PTCR_Msk instead)  */
#define TWI_PTCR_Msk                        _U_(0x10F0303)                                 /**< (TWI_PTCR) Register Mask  */


/* -------- TWI_PTSR : (TWI Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TWI_PTSR_Type;
