ataradov/mcu-starter-projects/samg53/include/component/twi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWI_PTSR_OFFSET                     (0x124)                                       /**<  (TWI_PTSR) Transfer Status Register  Offset */

#define TWI_PTSR_RXTEN_Pos                  0                                              /**< (TWI_PTSR) Receiver Transfer Enable Position */
#define TWI_PTSR_RXTEN_Msk                  (_U_(0x1) << TWI_PTSR_RXTEN_Pos)               /**< (TWI_PTSR) Receiver Transfer Enable Mask */
#define TWI_PTSR_RXTEN                      TWI_PTSR_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTSR_RXTEN_Msk instead */
#define TWI_PTSR_TXTEN_Pos                  8                                              /**< (TWI_PTSR) Transmitter Transfer Enable Position */
#define TWI_PTSR_TXTEN_Msk                  (_U_(0x1) << TWI_PTSR_TXTEN_Pos)               /**< (TWI_PTSR) Transmitter Transfer Enable Mask */
#define TWI_PTSR_TXTEN                      TWI_PTSR_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTSR_TXTEN_Msk instead */
#define TWI_PTSR_RXCBEN_Pos                 16                                             /**< (TWI_PTSR) Receiver Circular Buffer Enable Position */
#define TWI_PTSR_RXCBEN_Msk                 (_U_(0x1) << TWI_PTSR_RXCBEN_Pos)              /**< (TWI_PTSR) Receiver Circular Buffer Enable Mask */
#define TWI_PTSR_RXCBEN                     TWI_PTSR_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTSR_RXCBEN_Msk instead */
#define TWI_PTSR_TXCBEN_Pos                 18                                             /**< (TWI_PTSR) Transmitter Circular Buffer Enable Position */
#define TWI_PTSR_TXCBEN_Msk                 (_U_(0x1) << TWI_PTSR_TXCBEN_Pos)              /**< (TWI_PTSR) Transmitter Circular Buffer Enable Mask */
#define TWI_PTSR_TXCBEN                     TWI_PTSR_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTSR_TXCBEN_Msk instead */
#define TWI_PTSR_ERR_Pos                    24                                             /**< (TWI_PTSR) Transfer Bus Error Position */
#define TWI_PTSR_ERR_Msk                    (_U_(0x1) << TWI_PTSR_ERR_Pos)                 /**< (TWI_PTSR) Transfer Bus Error Mask */
#define TWI_PTSR_ERR                        TWI_PTSR_ERR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TWI_PTSR_ERR_Msk instead */
#define TWI_PTSR_MASK                       _U_(0x1050101)                                 /**< \deprecated (TWI_PTSR) Register MASK  (Use TWI_PTSR_Msk instead)  */
#define TWI_PTSR_Msk                        _U_(0x1050101)                                 /**< (TWI_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief TWI hardware registers */
typedef struct {  
  __O  uint32_t TWI_CR;         /**< (TWI Offset: 0x00) Control Register */
  __IO uint32_t TWI_MMR;        /**< (TWI Offset: 0x04) Master Mode Register */
  __IO uint32_t TWI_SMR;        /**< (TWI Offset: 0x08) Slave Mode Register */
  __IO uint32_t TWI_IADR;       /**< (TWI Offset: 0x0C) Internal Address Register */
  __IO uint32_t TWI_CWGR;       /**< (TWI Offset: 0x10) Clock Waveform Generator Register */
  RoReg8  Reserved1[0xC];
  __I  uint32_t TWI_SR;         /**< (TWI Offset: 0x20) Status Register */
  __O  uint32_t TWI_IER;        /**< (TWI Offset: 0x24) Interrupt Enable Register */
  __O  uint32_t TWI_IDR;        /**< (TWI Offset: 0x28) Interrupt Disable Register */
  __I  uint32_t TWI_IMR;        /**< (TWI Offset: 0x2C) Interrupt Mask Register */
  __I  uint32_t TWI_RHR;        /**< (TWI Offset: 0x30) Receive Holding Register */
  __O  uint32_t TWI_THR;        /**< (TWI Offset: 0x34) Transmit Holding Register */
  RoReg8  Reserved2[0xAC];
  __IO uint32_t TWI_WPMR;       /**< (TWI Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t TWI_WPSR;       /**< (TWI Offset: 0xE8) Write Protection Status Register */
  RoReg8  Reserved3[0x14];
  __IO uint32_t TWI_RPR;        /**< (TWI Offset: 0x100) Receive Pointer Register */
  __IO uint32_t TWI_RCR;        /**< (TWI Offset: 0x104) Receive Counter Register */
  __IO uint32_t TWI_TPR;        /**< (TWI Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t TWI_TCR;        /**< (TWI Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t TWI_RNPR;       /**< (TWI Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t TWI_RNCR;       /**< (TWI Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t TWI_TNPR;       /**< (TWI Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t TWI_TNCR;       /**< (TWI Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t TWI_PTCR;       /**< (TWI Offset: 0x120) Transfer Control Register */
  __I  uint32_t TWI_PTSR;       /**< (TWI Offset: 0x124) Transfer Status Register */
} Twi;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief TWI hardware registers */
typedef struct {  
  __O  TWI_CR_Type                    TWI_CR;         /**< Offset: 0x00 ( /W  32) Control Register */
  __IO TWI_MMR_Type                   TWI_MMR;        /**< Offset: 0x04 (R/W  32) Master Mode Register */
  __IO TWI_SMR_Type                   TWI_SMR;        /**< Offset: 0x08 (R/W  32) Slave Mode Register */
  __IO TWI_IADR_Type                  TWI_IADR;       /**< Offset: 0x0C (R/W  32) Internal Address Register */
  __IO TWI_CWGR_Type                  TWI_CWGR;       /**< Offset: 0x10 (R/W  32) Clock Waveform Generator Register */
  __I  uint32_t                       Reserved1[3];
  __I  TWI_SR_Type                    TWI_SR;         /**< Offset: 0x20 (R/   32) Status Register */
  __O  TWI_IER_Type                   TWI_IER;        /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O  TWI_IDR_Type                   TWI_IDR;        /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I  TWI_IMR_Type                   TWI_IMR;        /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I  TWI_RHR_Type                   TWI_RHR;        /**< Offset: 0x30 (R/   32) Receive Holding Register */
  __O  TWI_THR_Type                   TWI_THR;        /**< Offset: 0x34 ( /W  32) Transmit Holding Register */
  __I  uint32_t                       Reserved2[43];
  __IO TWI_WPMR_Type                  TWI_WPMR;       /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  TWI_WPSR_Type                  TWI_WPSR;       /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I  uint32_t                       Reserved3[5];
  __IO TWI_RPR_Type                   TWI_RPR;        /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO TWI_RCR_Type                   TWI_RCR;        /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO TWI_TPR_Type                   TWI_TPR;        /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO TWI_TCR_Type                   TWI_TCR;        /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO TWI_RNPR_Type                  TWI_RNPR;       /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO TWI_RNCR_Type                  TWI_RNCR;       /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO TWI_TNPR_Type                  TWI_TNPR;       /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO TWI_TNCR_Type                  TWI_TNCR;       /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  TWI_PTCR_Type                  TWI_PTCR;       /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  TWI_PTSR_Type                  TWI_PTSR;       /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Twi;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Two-wire Interface */

#endif /* _SAMG53_TWI_COMPONENT_H_ */
